# vim:ft=ruby

if OS.mac?
    # taps
    tap "homebrew/cask"
    tap "homebrew/cask-fonts"
    tap "koekeishiya/formulae"

    brew "noti" # utility to display notifications from scripts
    brew "trash" # rm, but put in the trash rather than completely delete

    # Applications
    cask "obsidian" # second brain
    cask "imageoptim" # a tool to optimize images
    cask "bitwarden" # password manager
    cask "wezterm" # a better terminal emulator
    cask "visual-studio-code"
    cask "orbstack" # Docker Desktop replacement
    cask "raycast"

    # yabai
    brew "yabai"
    brew "skhd"

    # Fonts
    cask "font-fira-code"
    cask "font-jetbrains-mono"
    cask "font-cascadia-mono"
    cask "font-meslo-lg-nerd-font"
    cask "font-meslo-for-powerline"
    cask "font-recursive-code"
elsif OS.linux?
    brew "xclip" # access to clipboard (similar to pbcopy/pbpaste)
end

tap "homebrew/bundle"
tap "homebrew/core"

# packages
brew "bat" # better cat
brew "cloc" # lines of code counter
brew "entr" # file watcher / command runner
brew "exa" # ls alternative
brew "fd" # find alternative

# node
brew "fnm" # Fast Node version manager
brew "yarn" # package manager

# vim
# brew "fzf" # Fuzzy file searcher, used in scripts and in vim
# brew "neofetch" # pretty system info
# brew "neovim" # A better vim
# brew "vim" # Vim (latest)

# git and friends
brew "gh" # GitHub CLI
brew "git" # Git version control (latest version)
brew "git-delta" # a better git diff
brew "lazygit" # a better git UI

# terminal
brew "tmux" # terminal multiplexer
brew "tree" # pretty-print directory contents
brew "z" # switch between most used directories
brew "zoxide" # switch between most used directories
brew "zsh" # zsh (latest)
brew "htop" # a top alternative
brew "bitwarden-cli" # bitwarden cli

brew "glow" # markdown viewer
brew "gnupg" # GPG
brew "grep" # grep (latest)
brew "highlight" # code syntax highlighting
brew "jq" # work with JSON files in shell scripts
brew "ripgrep" # very fast file searcher
brew "shellcheck" # diagnostics for shell sripts
brew "wdiff" # word differences in text files
brew "wget" # internet file retriever

# languages
brew "dotnet@6" # .NET 6
brew "python" # python (latst)